<?php
/**
 * Created by PhpStorm.
 * User: zhu
 * Email: ylsc633@gmail.com
 * Date: 2017/4/12
 * Time: 下午6:01
 */

return [
    //default
    0 => '成功',

    400000000 => '有点不正常，请稍后再试',
    400000001 => '数据不存在,请检查后再试',

    //post
    401000000 => '请输入帖子标题',

    //node
    402000000 => '请输入父节点ID',
    402000001 => '请输入权重',
    402000002 => '请输入节点别名',
    402000003 => '请输入节点名称',
    402000004 => '节点别名已存在,请检查后再试',
    402000005 => '节点名称已存在,请检查后再试',
    402000006 => '节点名称格式不正确,请检查后再试',
    402000007 => '节点名称过长,请检查后再试',
    402000008 => '节点level级别过高,请检查后再试',
    402000009 => '父节点设置有逻辑错误,请检查后再试',
    402000010 => '该节点下还有子节点,不允许删除,请检查后再试',



];